<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads Adobe Flash Player installer and extracts the embedded package, uploads to JSS.</string>
        <key>Identifier</key>
        <string>com.github.novaksam.AdobeFlashPlayer.jss</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Adobe Flash Player</string>
            <key>CATEGORY</key>
            <string>Plugins and Frameworks</string>
            <key>POLICY_CATEGORY</key>
            <string>Third Party Applications</string>
            <key>POLICY_TEMPLATE</key>
            <string>%RECIPE_DIR%/Templates/PolicyTemplate.xml</string>
            <key>POLICY_TRIGGER</key>
            <string>Install_Flash</string>
            <key>GROUP_NAME</key>
            <string>Outdated Flash - Test</string>
            <key>GROUP_TEMPLATE</key>
            <string>%RECIPE_DIR%/Templates/SmartGroupTemplate-Extension.xml</string>
            <key>ICON</key>
            <string>%RECIPE_DIR%/Images/AdobeFlash.png</string>
            <key>EXTENSION_NAME</key>
            <string>Flash Version - test</string>
            <key>EXTENSION_PATH</key>
            <string>/Library/Internet\ Plug-Ins/Flash\ Player.plugin/Contents</string>
            <key>EXTENSION_TEMPLATE</key>
            <string>%RECIPE_DIR%/Templates/ExtensionAttributeTemplate.xml</string>
            <key>EXTENSION_DESCRIPTION</key>
            <string>Returns the installed version of Adobe Flash Player.</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.4.0</string>
        <key>ParentRecipe</key>
        <string>com.github.autopkg.pkg.FlashPlayerExtractPackage</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>prod_name</key>
                    <string>%NAME%</string>
                    <key>category</key>
                    <string>%CATEGORY%</string>
                    <key>policy_category</key>
                    <string>%POLICY_CATEGORY%</string>
                    <key>policy_template</key>
                    <string>%POLICY_TEMPLATE%</string>
                    <key>policy_trigger</key>
                    <string>%POLICY_TRIGGER%</string>
                    <key>self_service_icon</key>
                    <string>%ICON%</string>
                    <key>extension_name</key>
                    <string>%EXTENSION_NAME%</string>
                    <key>extension_path</key>
                    <string>%EXTENSION_PATH%</string>
                    <key>extension_description</key>
                    <string>%EXTENSION_DESCRIPTION%</string>
                    <key>groups</key>
                    <array>
                        <dict>
                            <key>name</key>
                            <string>%GROUP_NAME%</string>
                            <key>smart</key>
                            <true/>
                            <key>template_path</key>
                            <string>%GROUP_TEMPLATE%</string>
                        </dict>
                    </array>
                    <key>extension_attributes</key>
                    <array>
                        <dict>
                            <key>extension_name</key>
                            <string>%EXTENSION_NAME%</string>
                            <key>extension_template</key>
                            <string>%EXTENSION_TEMPLATE%</string>
                        </dict>
                    </array>
                </dict>
                <key>Processor</key>
                <string>JSSImporter</string>
            </dict>
        </array>
    </dict>
</plist>
