<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads Adobe AIR installer and extracts the embedded package, uploads to JSS.</string>
        <key>Identifier</key>
        <string>com.github.novaksam.AdobeAIR.jss</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Adobe AIR</string>
            <key>CATEGORY</key>
            <string>Plugins and Frameworks</string>
            <key>POLICY_CATEGORY</key>
            <string>Third Party Applications</string>
            <key>POLICY_TEMPLATE</key>
            <string>%RECIPE_DIR%/Templates/PolicyTemplate.xml</string>
            <key>POLICY_CHECKIN</key>
            <string>false</string>
            <key>POLICY_ENROLLMENT</key>
            <string>false</string>
            <key>POLICY_LOGIN</key>
            <string>false</string>
            <key>POLICY_LOGOUT</key>
            <string>false</string>
            <key>POLICY_NETWORK_STATE</key>
            <string>false</string>
            <key>POLICY_STARTUP</key>
            <string>false</string>
            <key>POLICY_TRIGGER</key>
            <string>Install_AIR</string>
            <key>GROUP_NAME</key>
            <string>Outdated AIR - Test</string>
            <key>GROUP_TEMPLATE</key>
            <string>%RECIPE_DIR%/Templates/SmartGroupTemplate-Extension.xml</string>
            <key>ICON</key>
            <string>%RECIPE_DIR%/Images/Shockwave.png</string>
            <key>EXTENSION_NAME</key>
            <string>Shockwave Version - test</string>
            <key>EXTENSION_PATH</key>
            <string>/Library/Internet\ Plug-Ins/DirectorShockwave.plugin/Contents</string>
            <key>EXTENSION_PARAMETER</key>
            <string>CFBundleShortVersionString</string>
            <key>EXTENSION_DATA_TYPE</key>
            <string>string</string>
            <key>EXTENSION_TEMPLATE</key>
            <string>%RECIPE_DIR%/Templates/ExtensionAttributeTemplate.xml</string>
            <key>EXTENSION_DESCRIPTION</key>
            <string>Returns the installed version of Adobe Shockwave.</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.4.0</string>
        <key>ParentRecipe</key>
        <string>com.github.jleggat.AdobeShockwavePlayer.pkg</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>prod_name</key>
                    <string>%NAME%</string>
                    <key>category</key>
                    <string>%CATEGORY%</string>
                    <key>policy_category</key>
                    <string>%POLICY_CATEGORY%</string>
                    <key>policy_template</key>
                    <string>%POLICY_TEMPLATE%</string>
                    <key>policy_checkin</key>
                    <string>%POLICY_CHECKIN%</string>
                    <key>policy_enrollment</key>
                    <string>%POLICY_ENROLLMENT%</string>
                    <key>policy_login</key>
                    <string>%POLICY_LOGIN%</string>
                    <key>policy_logout</key>
                    <string>%POLICY_LOGOUT%</string>
                    <key>policy_network_state</key>
                    <string>%POLICY_NETWORK_STATE%</string>
                    <key>policy_startup</key>
                    <string>%POLICY_STARTUP%</string>
                    <key>policy_trigger</key>
                    <string>%POLICY_TRIGGER%</string>
                    <key>self_service_icon</key>
                    <string>%ICON%</string>
                    <key>extension_name</key>
                    <string>%EXTENSION_NAME%</string>
                    <key>extension_path</key>
                    <string>%EXTENSION_PATH%</string>
                    <key>extension_parameter</key>
                    <string>%EXTENSION_PARAMETER%</string>
                    <key>extension_data_type</key>
                    <string>%EXTENSION_DATA_TYPE%</string>
                    <key>extension_description</key>
                    <string>%EXTENSION_DESCRIPTION%</string>
                    <key>groups</key>
                    <array>
                        <dict>
                            <key>name</key>
                            <string>%GROUP_NAME%</string>
                            <key>smart</key>
                            <true/>
                            <key>template_path</key>
                            <string>%GROUP_TEMPLATE%</string>
                        </dict>
                    </array>
                    <key>extension_attributes</key>
                    <array>
                        <dict>
                            <key>extension_name</key>
                            <string>%EXTENSION_NAME%</string>
                            <key>extension_template</key>
                            <string>%EXTENSION_TEMPLATE%</string>
                        </dict>
                    </array>
                </dict>
                <key>Processor</key>
                <string>JSSImporter</string>
            </dict>
        </array>
    </dict>
</plist>
