<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current Adobe Reader pkg and repackages, replacing a problematic preinstall script, 
and enabling installation on non-boot volumes. Setting MAJOR_VERSION to "10" will cause a download of the 
latest/last version of Adobe Reader 10, but the repackager is unlikely to operate properly with that version.
This recipe is a retooling of the AdobeReader recipe provided by autopkg. All of the base work goes to them,
I just wanted to tweak it a little and get the version number on the installer.
</string>
    <key>Identifier</key>
    <string>com.github.novaksam.pkg.AdobeReader</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Adobe Reader</string>
        <key>MAJOR_VERSION</key>
        <string>11</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>ParentRecipe</key>
    <string>com.github.autopkg.download.AdobeReader</string>
    <key>Process</key>
    <array>
			<dict>
		    	<key>Processor</key>
		        <string>PkgCopier</string>
		        <key>Arguments</key>
		        <dict>
		        	<key>source_pkg</key>
		        	<string>%pathname%/*.pkg</string>
		        	<key>pkg_path</key>
		        	<string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
		        </dict>
		   	</dict>
		   	<dict>
		    	<key>Processor</key>
		        <string>FlatPkgUnpacker</string>
		        <key>Arguments</key>
		        <dict>
		        	<key>flat_pkg_path</key>
		        	<string>%pkg_path%</string>
		        	<key>destination_path</key>
		        	<string>%RECIPE_CACHE_DIR%/downloads/UNPACK</string>
		        </dict>
		   	</dict>
		   	<dict>
		    	<key>Processor</key>
		        <string>PkgPayloadUnpacker</string>
		        <key>Arguments</key>
		        <dict>
		        	<key>pkg_payload_path</key>
		        	<string>%RECIPE_CACHE_DIR%/downloads/UNPACK/application.pkg/Payload</string>
		        	<key>destination_path</key>
		        	<string>%RECIPE_CACHE_DIR%/downloads/PAYLOAD</string>
		        </dict>
		   	</dict>
		   	<dict>
		    	<key>Processor</key>
		        <string>Versioner</string>
		        <key>Arguments</key>
		        <dict>
		        	<key>input_plist_path</key>
		        	<string>%RECIPE_CACHE_DIR%/downloads/PAYLOAD/Adobe Reader.app/Contents/Info.plist</string>
		        </dict>
		   	</dict>
		   	<dict>
		    	<key>Processor</key>
		        <string>PkgCopier</string>
		        <key>Arguments</key>
		        <dict>
		        	<key>source_pkg</key>
		        	<string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
		        	<key>pkg_path</key>
		        	<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
		        </dict>
		   	</dict>
    </array>
</dict>
</plist>