<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Packages a local installation of Final Cut Pro, then uploads to the JSS.</string>
        <key>Identifier</key>
        <string>com.github.novaksam.jss.FinalCutPro</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Final Cut Pro</string>
            <key>CATEGORY</key>
            <string>Media</string>
            <key>POLICY_CATEGORY</key>
            <string>Third Party Updates</string>
            <key>PATH</key>
			<string>/Applications/Final Cut Pro X/%NAME%.app</string>
            <key>POLICY_TEMPLATE</key>
            <string>%RECIPE_DIR%/Templates/PolicyTemplate.xml</string>
            <key>POLICY_TRIGGER</key>
            <string>Install_FinalCutPro</string>
            <key>GROUP_NAME</key>
            <string>Outdated Final Cut Pro - Test</string>
            <key>GROUP_TEMPLATE</key>
            <string>%RECIPE_DIR%/Templates/SmartGroupTemplate-Application.xml</string>
            <key>ICON</key>
            <string>%RECIPE_DIR%/Images/FinalCutPro.png</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.4.0</string>
        <key>ParentRecipe</key>
        <string>com.github.nmcspadden.pkg.appstore</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>prod_name</key>
                    <string>%NAME%</string>
                    <key>category</key>
                    <string>%CATEGORY%</string>
                    <key>policy_category</key>
                    <string>%POLICY_CATEGORY%</string>
                    <key>policy_template</key>
                    <string>%POLICY_TEMPLATE%</string>
                    <key>policy_trigger</key>
                    <string>%POLICY_TRIGGER%</string>
                    <key>self_service_icon</key>
                    <string>%ICON%</string>
                    <key>os_requirements</key>
                    <string>10.9.x,10.10.x</string>
                    <key>groups</key>
                    <array>
                        <dict>
                            <key>name</key>
                            <string>%GROUP_NAME%</string>
                            <key>smart</key>
                            <true/>
                            <key>template_path</key>
                            <string>%GROUP_TEMPLATE%</string>
                        </dict>
                    </array>
                    <key>version</key>
					<string>%version%</string>
                </dict>
                <key>Processor</key>
                <string>JSSImporter</string>
            </dict>
        </array>
    </dict>
</plist>
