<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads latest MS Office 2011 update package, uploads to JSS.</string>
        <key>Identifier</key>
        <string>com.github.novaksam.jss.MSOffice2011Updates</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Microsoft Office 2011 Updates</string>
            <key>CATEGORY</key>
            <string>Office</string>
            <key>POLICY_CATEGORY</key>
            <string>Third Party Updates</string>
            <key>POLICY_TEMPLATE</key>
            <string>%RECIPE_DIR%/Templates/PolicyTemplate.xml</string>
            <key>POLICY_TRIGGER</key>
            <string>Install_MSOffice2011Updates</string>
            <key>GROUP_NAME</key>
            <string>Outdated Microsoft Office 2011 - Test</string>
            <key>GROUP_TEMPLATE</key>
            <string>%RECIPE_DIR%/Templates/SmartGroupTemplate-Application-MsOffice2011.xml</string>
            <key>ICON</key>
            <string>%RECIPE_DIR%/Images/MSOffice.png</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.4.0</string>
        <key>ParentRecipe</key>
        <string>com.github.autopkg.pkg.Office2011Updates</string>
        <key>Process</key>
        <array>
        	<dict>
		    	<key>Processor</key>
		        <string>FlatPkgUnpacker</string>
		        <key>Arguments</key>
		        <dict>
		        	<key>flat_pkg_path</key>
		        	<string>%pkg_path%</string>
		        	<key>destination_path</key>
		        	<string>%RECIPE_CACHE_DIR%/downloads/UNPACK</string>
		        </dict>
		   	</dict>
		   	<dict>
            	<key>Processor</key>
            	<string>FileFinder</string>
            	<key>Arguments</key>
            	<dict>
                	<key>pattern</key>
                	<string>%RECIPE_CACHE_DIR%/downloads/UNPACK/Office2011_all_quit*</string>
            	</dict>
        	</dict>
		   	<dict>
		    	<key>Processor</key>
		        <string>Versioner</string>
		        <key>Arguments</key>
		        <dict>
		        	<key>input_plist_path</key>
		        	<string>%found_filename%/Scripts/QuitApps.app/Contents/Info.plist</string>
		        	<key>plist_version_key</key>
		        	<string>CFBundleVersion</string>
		        </dict>
		   	</dict>
		   	<dict>
		    	<key>Processor</key>
		        <string>PathDeleter</string>
		        <key>Comment</key>
            	<string>Gotta clean up after myself!</string>
		        <key>Arguments</key>
		        <dict>
		        	<key>path_list</key>
		        	<array>
						<string>%RECIPE_CACHE_DIR%/downloads/UNPACK</string>
					</array>
		        </dict>
		   	</dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>prod_name</key>
                    <string>%NAME%</string>
                    <key>category</key>
                    <string>%CATEGORY%</string>
                    <key>policy_category</key>
                    <string>%POLICY_CATEGORY%</string>
                    <key>policy_template</key>
                    <string>%POLICY_TEMPLATE%</string>
                    <key>policy_trigger</key>
                    <string>%POLICY_TRIGGER%</string>
                    <key>self_service_icon</key>
                    <string>%ICON%</string>
                    <key>groups</key>
                    <array>
                        <dict>
                            <key>name</key>
                            <string>%GROUP_NAME%</string>
                            <key>smart</key>
                            <true/>
                            <key>template_path</key>
                            <string>%GROUP_TEMPLATE%</string>
                        </dict>
                    </array>
                </dict>
                <key>Processor</key>
                <string>JSSImporter</string>
            </dict>
        </array>
    </dict>
</plist>
