<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest CUDA toolkit from Nvidia.</string>
    <key>Identifier</key>
    <string>com.github.novaksam.download.NvidiaCudaToolkit</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>NvidiaCudaToolkit</string>
        <key>SEARCH_URL</key>
        <string>https://developer.nvidia.com/cuda-downloads</string>
        <key>SEARCH_PATTERN</key>
        <string>(http\://developer.download.nvidia.com/compute/cuda/[0-9]_[0-9]/Prod/local_installers/cuda_[0-9].[0-9].[0-9][0-9]_mac.pkg)</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%</string>
                <key>re_pattern</key>
                <string>%SEARCH_PATTERN%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%match%</string>
                <key>filename</key>
                <string>%NAME%.pkg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>