<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Oracle Java 8 JDK and creates a package.</string>
	<key>Identifier</key>
	<string>com.github.novaksam.pkg.OracleJava8JDK</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Oracle Java 8 JDK</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.hansen-m.download.OracleJava8JDK</string>
	<key>Process</key>
	<array>
			<dict>
		    	<key>Processor</key>
		        <string>PkgCopier</string>
		        <key>Arguments</key>
		        <dict>
		        	<key>source_pkg</key>
		        	<string>%pathname%/*.pkg</string>
		        	<key>pkg_path</key>
		        	<string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
		        </dict>
		   	</dict>
		   	<dict>
		    	<key>Processor</key>
		        <string>FlatPkgUnpacker</string>
		        <key>Arguments</key>
		        <dict>
		        	<key>flat_pkg_path</key>
		        	<string>%pkg_path%</string>
		        	<key>destination_path</key>
		        	<string>%RECIPE_CACHE_DIR%/downloads/UNPACK</string>
		        </dict>
		   	</dict>
		   	<dict>
		    	<key>Processor</key>
		        <string>FileFinder</string>
		        <key>Arguments</key>
		        <dict>
		        	<key>pattern</key>
		        	<string>%RECIPE_CACHE_DIR%/downloads/UNPACK/jdk*.pkg</string>
		        </dict>
		   	</dict>
		   	<dict>
		    	<key>Processor</key>
		        <string>PkgPayloadUnpacker</string>
		        <key>Arguments</key>
		        <dict>
		        	<key>pkg_payload_path</key>
		        	<string>%found_filename%/Payload</string>
		        	<key>destination_path</key>
		        	<string>%RECIPE_CACHE_DIR%/downloads/PAYLOAD</string>
		        </dict>
		   	</dict>
		   	<dict>
		    	<key>Processor</key>
		        <string>Versioner</string>
		        <key>Arguments</key>
		        <dict>
		        	<key>input_plist_path</key>
		        	<string>%RECIPE_CACHE_DIR%/downloads/PAYLOAD/Contents/Info.plist</string>
		        	<key>plist_version_key</key>
		        	<string>CFBundleVersion</string>
		        </dict>
		   	</dict>
		   	<dict>
		    	<key>Processor</key>
		        <string>PkgCopier</string>
		        <key>Arguments</key>
		        <dict>
		        	<key>source_pkg</key>
		        	<string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
		        	<key>pkg_path</key>
		        	<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
		        </dict>
		   	</dict>
		   	<dict>
		    	<key>Processor</key>
		        <string>FileMover</string>
		        <key>Comment</key>
            	<string>Prepare for cleanup.</string>
		        <key>Arguments</key>
		        <dict>
		        	<key>source</key>
		        	<string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
		        	<key>target</key>
		        	<string>%RECIPE_CACHE_DIR%/downloads/%NAME%.pkg</string>
		        </dict>
		   	</dict>
		   	<dict>
		    	<key>Processor</key>
		        <string>PathDeleter</string>
		        <key>Comment</key>
            	<string>Gotta clean up after myself!</string>
		        <key>Arguments</key>
		        <dict>
		        	<key>path_list</key>
		        	<array>
						<string>%RECIPE_CACHE_DIR%/downloads/UNPACK</string>
						<string>%RECIPE_CACHE_DIR%/downloads/%NAME%.pkg</string>
					</array>
		        </dict>
		   	</dict>
	</array>
</dict>
</plist>
