<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads Oracle Java 8 installer and extracts the embedded package, uploads to JSS.</string>
        <key>Identifier</key>
        <string>com.github.novaksam.jss.OracleJava8</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Oracle Java</string>
            <key>CATEGORY</key>
            <string>Plugins and Frameworks</string>
            <key>POLICY_CATEGORY</key>
            <string>Third Party Updates</string>
            <key>POLICY_TEMPLATE</key>
            <string>%RECIPE_DIR%/Templates/PolicyTemplate.xml</string>
            <key>POLICY_TRIGGER</key>
            <string>Install_Java8</string>
            <key>GROUP_NAME</key>
            <string>Outdated Java8 - Test</string>
            <key>GROUP_TEMPLATE</key>
            <string>%RECIPE_DIR%/Templates/SmartGroupTemplate-Extension.xml</string>
            <key>ICON</key>
            <string>%RECIPE_DIR%/Images/OracleJava8.png</string>
            <key>EXTENSION_PATH</key>
            <string>/Library/Internet\ Plug-Ins/JavaAppletPlugin.plugin/Contents</string>
            <key>EXTENSION_TEMPLATE</key>
            <string>%RECIPE_DIR%/Templates/ExtensionAttributeTemplate.xml</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.4.0</string>
        <key>ParentRecipe</key>
        <string>com.github.autopkg.pkg.OracleJava8</string>
        <key>Process</key>
        <array>
        	<dict>
		    	<key>Processor</key>
		        <string>Versioner</string>
		        <key>Arguments</key>
		        <dict>
		        	<key>input_plist_path</key>
		        	<string>%RECIPE_CACHE_DIR%/unpack/root/Library/Internet Plug-Ins/JavaAppletPlugin.plugin/Contents/Info.plist</string>
		        </dict>
		   	</dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>prod_name</key>
                    <string>%NAME%</string>
                    <key>category</key>
                    <string>%CATEGORY%</string>
                    <key>policy_category</key>
                    <string>%POLICY_CATEGORY%</string>
                    <key>policy_template</key>
                    <string>%POLICY_TEMPLATE%</string>
                    <key>policy_trigger</key>
                    <string>%POLICY_TRIGGER%</string>
                    <key>self_service_icon</key>
                    <string>%ICON%</string>
                    <key>extension_path</key>
                    <string>%EXTENSION_PATH%</string>
                    <key>groups</key>
                    <array>
                        <dict>
                            <key>name</key>
                            <string>%GROUP_NAME%</string>
                            <key>smart</key>
                            <true/>
                            <key>template_path</key>
                            <string>%GROUP_TEMPLATE%</string>
                        </dict>
                    </array>
                    <key>extension_attributes</key>
                    <array>
                        <dict>
                            <key>name</key>
                            <string>%NAME%</string>
                            <key>extension_template</key>
                            <string>%EXTENSION_TEMPLATE%</string>
                        </dict>
                    </array>
                </dict>
                <key>Processor</key>
                <string>JSSImporter</string>
            </dict>
        </array>
    </dict>
</plist>
