<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of jamovi.</string>
	<key>Identifier</key>
	<string>com.github.novaksam.download.jamovi</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>jamovi</string>
		<!--
		  Release has two options available. Either current or solid.
		-->
		<key>RELEASE</key>
		<string>solid</string>
		<!--
		  Use macos-arm64 or macos-x64 based on your need. Default is macos-x64.
		-->
		<key>ARCH</key>
		<string>macos-x64</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>&lt;td&gt;(%RELEASE%)&lt;\/td&gt;&lt;td&gt;(\d+\.\d+\.\d+)&lt;\/td&gt;&lt;td&gt;x64|arm64&lt;\/td&gt;&lt;td&gt;\.dmg&lt;\/td&gt;</string>
				<key>url</key>
				<string>https://www.jamovi.org/download.html</string>
				<key>result_output_var_name</key>
                		<string>version</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>(dl.jamovi.org/.*%version%.*-%ARCH%.dmg)</string>
				<key>url</key>
				<string>https://www.jamovi.org/download.html</string>
				<key>result_output_var_name</key>
                		<string>url</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
                		<key>prefetch_filename</key>
                		<string>True</string>
				<key>url</key>
				<string>https://%url%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/jamovi.app</string>
				<key>requirement</key>
				<string>identifier "org.jamovi.jamovi" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "9NCBP559AB"</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
