<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Adobe Digital Editions and creates a package.</string>
	<key>Identifier</key>
	<string>com.github.novaksam.pkg.AdobeDigitalEditions</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Adobe Digital Editions</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.hansen-m.download.AdobeDigitalEditions</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: Adobe Systems, Inc. (JQ525L2MZD)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
				<key>input_path</key>
				<string>%pathname%/*.pkg</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%NAME%.pkg</string>
				<key>source_path</key>
				<string>%pathname%/*.pkg</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/UNPACK</string>
				<key>flat_pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%NAME%.pkg</string>
			</dict>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/PAYLOAD</string>
				<key>pkg_payload_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/UNPACK/build.pkg/Payload</string>
			</dict>
			<key>Processor</key>
			<string>PkgPayloadUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%NAME%.app</string>
				<key>source_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/PAYLOAD/*.app</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%NAME%.app/Contents/Info.plist</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%NAME%.app/Contents/Info.plist</string>
			</dict>
			<key>Processor</key>
			<string>com.github.autopkg.novaksam-recipes.Processors/MinimumOSExtractor</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/downloads/%NAME%.app</string>
				</array>
			</dict>
			<key>Comment</key>
			<string>Deleting the application because it was only used for versioning</string>
			<key>Processor</key>
			<string>PathDeleter</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pathname</key>
				<string>%RECIPE_CACHE_DIR%/downloads/UNPACK/build.pkg/Scripts/post</string>
				<key>replacement_text</key>
				<string>#open "$2/$DE_APP"</string>
				<key>text_to_replace</key>
				<string>open "$2/$DE_APP"</string>
			</dict>
			<key>Processor</key>
			<string>com.github.autopkg.novaksam-recipes.Processors/FlatPkgScriptEditor</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/downloads/%NAME%.pkg</string>
				</array>
			</dict>
			<key>Comment</key>
			<string>Delete original installer from Adobe</string>
			<key>Processor</key>
			<string>PathDeleter</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_pkg</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%NAME%.pkg</string>
				<key>source_flatpkg_dir</key>
				<string>%RECIPE_CACHE_DIR%/downloads/UNPACK</string>
			</dict>
			<key>Processor</key>
			<string>FlatPkgPacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/downloads/UNPACK</string>
					<string>%RECIPE_CACHE_DIR%/downloads/PAYLOAD</string>
				</array>
			</dict>
			<key>Comment</key>
			<string>Deleting unpack and payload folders</string>
			<key>Processor</key>
			<string>PathDeleter</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
				<key>source_pkg</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%NAME%.pkg</string>
			</dict>
			<key>Processor</key>
			<string>PkgCopier</string>
		</dict>
	</array>
</dict>
</plist>
