<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Adobe Digital Editions and creates a package.</string>
	<key>Identifier</key>
	<string>com.github.novaksam.pkg.AdobeDigitalEditions</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Adobe Digital Editions</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.hansen-m.download.AdobeDigitalEditions</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/*.pkg</string>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: Adobe Systems, Inc.</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
			</dict>
		</dict>
			<dict>
				<key>Processor</key>
				<string>Copier</string>
				<key>Arguments</key>
				<dict>
					<key>source_path</key>
					<string>%pathname%/*.pkg</string>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/downloads/%NAME%.pkg</string>
				</dict>
			</dict>
		   	<dict>
				<key>Processor</key>
				<string>FlatPkgUnpacker</string>
				<key>Arguments</key>
				<dict>
					<key>flat_pkg_path</key>
					<string>%RECIPE_CACHE_DIR%/downloads/%NAME%.pkg</string>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/downloads/UNPACK</string>
				</dict>
		   	</dict>
		   	<dict>
				<key>Processor</key>
				<string>PkgPayloadUnpacker</string>
				<key>Arguments</key>
				<dict>
					<key>pkg_payload_path</key>
					<string>%RECIPE_CACHE_DIR%/downloads/UNPACK/build.pkg/Payload</string>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/downloads/PAYLOAD</string>
				</dict>
		   	</dict>
		   	<dict>
				<key>Processor</key>
				<string>Copier</string>
				<key>Arguments</key>
				<dict>
					<key>source_path</key>
					<string>%RECIPE_CACHE_DIR%/downloads/PAYLOAD/*.app</string>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/downloads/%NAME%.app</string>
				</dict>
		   	</dict>
		   	<dict>
				<key>Processor</key>
				<string>Versioner</string>
				<key>Arguments</key>
				<dict>
					<key>input_plist_path</key>
					<string>%RECIPE_CACHE_DIR%/downloads/%NAME%.app/Contents/Info.plist</string>
				</dict>
		   	</dict>
		   	<dict>
				<key>Processor</key>
				<string>PathDeleter</string>
				<key>Comment</key>
				<string>Gotta clean up after myself!</string>
				<key>Arguments</key>
				<dict>
					<key>path_list</key>
					<array>
						<string>%RECIPE_CACHE_DIR%/downloads/UNPACK</string>
						<string>%RECIPE_CACHE_DIR%/downloads/PAYLOAD</string>
						<string>%RECIPE_CACHE_DIR%/downloads/%NAME%.app</string>
					</array>
				</dict>
		   	</dict>
		   	<dict>
				<key>Processor</key>
				<string>PkgCopier</string>
				<key>Arguments</key>
				<dict>
					<key>source_pkg</key>
					<string>%RECIPE_CACHE_DIR%/downloads/%NAME%.pkg</string>
					<key>pkg_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
				</dict>
			</dict>
	</array>
</dict>
</plist>
