<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current Adobe Reader pkg and repackages, replacing a problematic preinstall script, 
and enabling installation on non-boot volumes. Setting MAJOR_VERSION to "10" will cause a download of the 
latest/last version of Adobe Reader 10, but the repackager is unlikely to operate properly with that version.
This recipe is a retooling of the AdobeReader recipe provided by autopkg. All of the base work goes to them,
I just wanted to tweak it a little and get the version number on the installer.
</string>
	<key>Identifier</key>
	<string>com.github.novaksam.pkg.AdobeReader</string>
	<key>Input</key>
	<dict>
		<key>MAJOR_VERSION</key>
		<string>11</string>
		<key>NAME</key>
		<string>Adobe Reader</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.download.AdobeReader</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
				<key>source_pkg</key>
				<string>%pathname%/*.pkg</string>
			</dict>
			<key>Processor</key>
			<string>PkgCopier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/UNPACK</string>
				<key>flat_pkg_path</key>
				<string>%pkg_path%</string>
			</dict>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/PAYLOAD</string>
				<key>pkg_payload_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/UNPACK/application.pkg/Payload</string>
			</dict>
			<key>Processor</key>
			<string>PkgPayloadUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/PAYLOAD/Adobe Reader.app/Contents/Info.plist</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
				<key>source_pkg</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
			</dict>
			<key>Processor</key>
			<string>PkgCopier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>source</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
				<key>target</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%NAME%.pkg</string>
			</dict>
			<key>Comment</key>
			<string>Prepare for cleanup.</string>
			<key>Processor</key>
			<string>FileMover</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/downloads/UNPACK</string>
					<string>%RECIPE_CACHE_DIR%/downloads/PAYLOAD</string>
					<string>%RECIPE_CACHE_DIR%/downloads/%NAME%.pkg</string>
				</array>
			</dict>
			<key>Comment</key>
			<string>Gotta clean up after myself!</string>
			<key>Processor</key>
			<string>PathDeleter</string>
		</dict>
	</array>
</dict>
</plist>
