<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest release of appleLoops from carlashley on github, and creates a pkg to install it, and the mandatory loops</string>
	<key>Identifier</key>
	<string>com.github.novaksam.pkg.appleLoopsMandatory</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>appleLoopsMandatory</string>
		<key>ScriptFolder</key>
		<string>%RECIPE_DIR%/appleLoopsMandatoryScripts</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.novaksam.download.appleLoops</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/Extract</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>bundleid</key>
				<string>com.github.carlashley.%NAME%</string>
				<key>pkg_build_name</key>
				<string>%NAME%-%version%</string>
				<key>pkg_dir</key>
				<string>%RECIPE_CACHE_DIR%</string>
				<key>version</key>
				<string>%version%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.nmcspadden.check.appstore/PkgBuildTester</string>
			<key>comment</key>
			<string>Look in our recipe cache for an existing, current package.</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>predicate</key>
				<string>pkg_build_matches == YES</string>
			</dict>
			<key>Processor</key>
			<string>StopProcessingIf</string>
			<key>comment</key>
			<string>If a package has already been built with this version and ID (and "force_pkg_build" is False), we're done.</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict>
					<key>usr</key>
					<string>0755</string>
					<key>usr/local/</key>
					<string>0755</string>
					<key>usr/local/bin/</key>
					<string>0775</string>
				</dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
			</dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%pkgroot%/usr/local/bin/</string>
				<key>source_path</key>
				<string>%RECIPE_CACHE_DIR%/Extract/appleLoops-%version%/appleLoops.py</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>chown</key>
					<array>
						<dict>
							<key>group</key>
							<string>admin</string>
							<key>path</key>
							<string>usr/local/bin</string>
							<key>user</key>
							<string>root</string>
						</dict>
					</array>
					<key>id</key>
					<string>com.github.carlashley.%NAME%</string>
					<key>options</key>
					<string>purge_ds_store</string>
					<key>pkgname</key>
					<string>%NAME%-%version%</string>
					<key>scripts</key>
					<string>%ScriptFolder%</string>
					<key>version</key>
					<string>%version%</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>PkgCreator</string>
		</dict>
	</array>
</dict>
</plist>
