<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest Github app and builds a package.</string>
	<key>Identifier</key>
	<string>com.github.novaksam.pkg.BlackboardCollaborateLauncher</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Blackboard Collaborate Launcher</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.download.blackboardcollaboratelauncher</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/Applications</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/Applications/Blackboard Collaborate Launcher.app</string>
				<key>requirement</key>
				<string>anchor apple generic and identifier "com.bbcollaborate.CollaborateLauncher" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = DF6BF8KM3L)</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/Applications/Blackboard Collaborate Launcher.app/Contents/Info.plist</string>
			</dict>
			<key>Processor</key>
			<string>com.github.autopkg.novaksam-recipes.Processors/MinimumOSExtractor</string>
		</dict>
		<dict>
		<key>Arguments</key>
			<dict>
				<key>app_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/Applications/*.app</string>
			</dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
		</dict>
	</array>
</dict>
</plist>
