<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest Brackets disk image and builds a package.
	Relies on the Github version string rather than the Info.plist within the app bundle.
	The application version is not reliably maintained by developer.</string>
	<key>Identifier</key>
	<string>com.github.novaksam.pkg.Brackets</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Brackets</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.novaksam.download.Brackets</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
		</dict>
	</array>
</dict>
</plist>
