<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Builds a package containing the installed version of Casper Suite</string>
    <key>Identifier</key>
    <string>com.github.novaksam.pkg.CasperSuite</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Casper Suite</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>Process</key>
    <array>
		<dict>
			<key>Processor</key>
			<string>PathListCopier</string>
			<key>Arguments</key>
			<dict>
				<key>check_version_path</key>
				<string>/Applications/%NAME%/Casper Imaging.app</string>
				<key>pathname</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				<key>sourcelist</key>
				<array>
					<string>/Applications/%NAME%</string>
				</array>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PlistReader</string>
			<key>Arguments</key>
			<dict>
				<key>info_path</key>
				<string>%pathname%/Applications/%NAME%/Casper Imaging.app</string>
				<key>plist_keys</key>
				<dict>
					<key>CFBundleIdentifier</key>
					<string>bundleid</string>
					<key>CFBundleShortVersionString</key>
					<string>version</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>chown</key>
					<array>
						<dict>
							<key>group</key>
							<string>admin</string>
							<key>path</key>
							<string>Applications</string>
							<key>user</key>
							<string>root</string>
						</dict>
					</array>
					<key>id</key>
					<string>%bundleid%</string>
					<key>options</key>
					<string>purge_ds_store</string>
					<key>pkgname</key>
					<string>%NAME%-%version%</string>
					<key>pkgroot</key>
					<string>%pathname%</string>
					<key>scripts</key>
                    <string>CasperSuiteScripts</string>
					<key>version</key>
					<string>%version%</string>
				</dict>
			</dict>
		</dict>
	</array>
</dict>
</plist>