<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest EndNote disk image and builds a package.</string>
    <key>Identifier</key>
    <string>com.github.novaksam.pkg.EndNote</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>EndNote X7</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>ParentRecipe</key>
    <string>com.github.hansen-m.download.EndNote</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>PlistReader</string>
            <key>Arguments</key>
            <dict>
            	<key>plist_keys</key>
            	<dict>
					<key>CFBundleIdentifier</key>
					<string>bundleid</string>
					<key>CFBundleShortVersionString</key>
					<string>version</string>
				</dict>
               	<key>info_path</key>
               	<string>%pathname%/%NAME%/%NAME%.app</string>
            </dict>
        </dict>
   		<dict>
            <key>Processor</key>
            <string>PkgBuildTester</string>
            <key>comment</key>
            <string>Look in our recipe cache for an existing, current package.</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_build_name</key>
                <string>%NAME%-%version%</string>
                <key>pkg_dir</key>
                <string>%RECIPE_CACHE_DIR%</string>
                <key>bundleid</key>
                <string>%bundleid%</string>
                <key>version</key>
                <string>%version%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
            <key>comment</key>
            <string>If a package has already been built with this version and ID (and "force_pkg_build" is False), we're done.</string>
            <key>Arguments</key>
            <dict>
                <key>predicate</key>
                <string>pkg_build_matches == YES</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>pkgdirs</key>
                <dict>
                    <key>Applications</key>
                    <string>0775</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
               	<key>source_path</key>
               	<string>%pathname%/%NAME%</string>
               	<key>destination_path</key>
               	<string>%pkgroot%/Applications/%NAME%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
               	<key>input_path</key>
               	<string>%pkgroot%/Applications/%NAME%/%NAME%.app</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_request</key>
                <dict>
                    <key>pkgname</key>
                    <string>%NAME%-%version%</string>
                    <key>version</key>
                    <string>%version%</string>
                    <key>id</key>
                    <string>%bundleid%</string>
                    <key>options</key>
                    <string>purge_ds_store</string>
                    <key>scripts</key>
                    <string>EndNoteScripts</string>
                    <key>chown</key>
                    <array>
                        <dict>
                            <key>path</key>
                            <string>Applications</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>admin</string>
                        </dict>
                    </array>
                </dict>
            </dict>
        </dict>
    </array>
</dict>
</plist>