<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest Github app and builds a package.</string>
    <key>Identifier</key>
    <string>com.github.novaksam.recipes.pkg.GitHub</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>GitHub Desktop</string>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.keeleysam.recipes.GitHub.download</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>pkgdirs</key>
                <dict>
                    <key>Applications</key>
                    <string>0775</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/Applications</string>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PlistReader</string>
            <key>Arguments</key>
            <dict>
            	<key>plist_keys</key>
            	<dict>
					<key>CFBundleIdentifier</key>
					<string>bundleid</string>
					<key>CFBundleVersion</key>
					<string>version</string>
				</dict>
               	<key>info_path</key>
               	<string>%RECIPE_CACHE_DIR%/%NAME%/Applications/%NAME%.app/Contents/Info.plist</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgBuildTester</string>
            <key>comment</key>
            <string>Look in our recipe cache for an existing, current package.</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_build_name</key>
                <string>%NAME%-%version%</string>
                <key>pkg_dir</key>
                <string>%RECIPE_CACHE_DIR%</string>
                <key>bundleid</key>
                <string>%bundleid%</string>
                <key>version</key>
                <string>%version%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
            <key>comment</key>
            <string>If a package has already been built with this version and ID (and "force_pkg_build" is False), we're done.</string>
            <key>Arguments</key>
            <dict>
                <key>predicate</key>
                <string>pkg_build_matches == YES</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_request</key>
                <dict>
                    <key>pkgname</key>
                    <string>%NAME%-%version%</string>
                    <key>version</key>
                    <string>%version%</string>
                    <key>id</key>
                    <string>%bundleid%</string>
                    <key>options</key>
                    <string>purge_ds_store</string>
                    <key>chown</key>
                    <array>
                        <dict>
                            <key>path</key>
                            <string>Applications</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>admin</string>
                        </dict>
                    </array>
                </dict>
            </dict>
        </dict>
    </array>
</dict>
</plist>
