<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Extract version number and other information from MAU</string>
	<key>Identifier</key>
	<string>com.github.novaksam.pkg.MicrosoftAutoUpdate</string>
	<key>Input</key>
	<dict>
		<key>CHANNEL</key>
		<string>Production</string>
		<key>LOCALE_ID</key>
		<string>1033</string>
		<key>NAME</key>
		<string>Microsoft AutoUpdate</string>
		<key>VERSION</key>
		<string>latest</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.download.MSAutoUpdate</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/UNPACK</string>
				<key>flat_pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%NAME%-%version%.pkg</string>
			</dict>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pattern</key>
				<string>%RECIPE_CACHE_DIR%/downloads/UNPACK/Office*_autoupdate_updater.pkg</string>
			</dict>
			<key>Processor</key>
			<string>FileFinder</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/PAYLOAD</string>
				<key>pkg_payload_path</key>
				<string>%found_filename%/Payload</string>
			</dict>
			<key>Processor</key>
			<string>PkgPayloadUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>source</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%NAME%-%version%.pkg</string>
				<key>target</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%NAME%.pkg</string>
			</dict>
			<key>Comment</key>
			<string>Relocate the pkg so that we can move it with %NAME%.pkg once we have the shorter version below</string>
			<key>Processor</key>
			<string>FileMover</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>info_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/PAYLOAD/Microsoft AutoUpdate.app</string>
				<key>plist_keys</key>
				<dict>
					<key>CFBundleIdentifier</key>
					<string>bundleid</string>
					<key>CFBundleShortVersionString</key>
					<string>version</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>PlistReader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/PAYLOAD/Microsoft AutoUpdate.app/Contents/Info.plist</string>
				<key>minimum_os_version</key>
				<string>10.7</string>
			</dict>
			<key>Comment</key>
			<string>Specifying a minimum os version here because the processor 
			that downloads MAU returns it's own variable of the same name 
			and causes issues in the generation of the OS_REQUIREMENTS list</string>
			<key>Processor</key>
			<string>com.github.autopkg.novaksam-recipes.Processors/MinimumOSExtractor</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
				<key>source_pkg</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%NAME%.pkg</string>
			</dict>
			<key>Processor</key>
			<string>PkgCopier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/downloads/UNPACK</string>
					<string>%RECIPE_CACHE_DIR%/downloads/PAYLOAD</string>
					<string>%RECIPE_CACHE_DIR%/downloads/%NAME%.pkg</string>
				</array>
			</dict>
			<key>Comment</key>
			<string>Gotta clean up after myself!</string>
			<key>Processor</key>
			<string>PathDeleter</string>
		</dict>
	</array>
</dict>
</plist>
