<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Builds a package for Practica Musica containing the license file of a locally installed copy</string>
	<key>Identifier</key>
	<string>com.github.novaksam.pkg.PracticaMusica</string>
	<key>Input</key>
	<dict>
		<key>Comments</key>
		<string>This pkg requires an existing installation of Practica Musica in /Applications, which it will grab the license file from.</string>
		<key>NAME</key>
		<string>Practica Musica</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.novaksam.download.PracticaMusica</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>info_path</key>
				<string>%pathname%/Practica Musica.app</string>
				<key>plist_keys</key>
				<dict>
					<key>CFBundleIdentifier</key>
					<string>bundleid</string>
					<key>CFBundleShortVersionString</key>
					<string>version</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>PlistReader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>bundleid</key>
				<string>%bundleid%</string>
				<key>pkg_build_name</key>
				<string>%NAME%-%version%</string>
				<key>pkg_dir</key>
				<string>%RECIPE_CACHE_DIR%</string>
				<key>version</key>
				<string>%version%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.autopkg.novaksam-recipes.Processors/PkgBuildTester</string>
			<key>comment</key>
			<string>Look in our recipe cache for an existing, current package.</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>predicate</key>
				<string>pkg_build_matches == YES</string>
			</dict>
			<key>Processor</key>
			<string>StopProcessingIf</string>
			<key>comment</key>
			<string>If a package has already been built with this version and ID (and "force_pkg_build" is False), we're done.</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict>
					<key>Applications</key>
					<string>0775</string>
				</dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
			</dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%pkgroot%/Applications/Practica Musica.app</string>
				<key>source_path</key>
				<string>%pathname%/Practica Musica.app</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>check_version_path</key>
				<string>/Applications/Practica Musica.app</string>
				<key>pathname</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/license/</string>
				<key>sourcelist</key>
				<array>
					<string>/Applications/Practica Musica.app/Practica Musica Preferences</string>
				</array>
			</dict>
			<key>Processor</key>
			<string>com.scriptingosx.processors/PathListCopier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/%NAME%/Applications/Practica Musica.app/Practica Musica Preferences</string>
				</array>
			</dict>
			<key>Comment</key>
			<string>Delete the included license file</string>
			<key>Processor</key>
			<string>PathDeleter</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/Applications/Practica Musica.app/</string>
				<key>source_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/license/Applications/Practica Musica.app/Practica Musica Preferences</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>modifier</key>
				<string>666</string>
				<key>pathname</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/Applications/Practica Musica.app/Practica Musica Preferences</string>
			</dict>
			<key>Processor</key>
			<string>com.github.autopkg.novaksam-recipes.Processors/FileChmodEditor</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/Applications/Practica Musica.app/Contents/Info.plist</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/Applications/Practica Musica.app/Contents/Info.plist</string>
			</dict>
			<key>Processor</key>
			<string>com.github.autopkg.novaksam-recipes.Processors/MinimumOSExtractor</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/%NAME%/license</string>
				</array>
			</dict>
			<key>Comment</key>
			<string>Delete the copied license file</string>
			<key>Processor</key>
			<string>PathDeleter</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>chown</key>
					<array>
						<dict>
							<key>group</key>
							<string>admin</string>
							<key>path</key>
							<string>Applications</string>
							<key>user</key>
							<string>root</string>
						</dict>
					</array>
					<key>id</key>
					<string>%bundleid%</string>
					<key>options</key>
					<string>purge_ds_store</string>
					<key>pkgname</key>
					<string>%NAME%-%version%</string>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%</string>
					<key>version</key>
					<string>%version%</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>PkgCreator</string>
		</dict>
	</array>
</dict>
</plist>
