<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Recipe automatically generated from local.jss.iMovie by JamfRecipeMaker</string>
	<key>Identifier</key>
	<string>com.github.novaksam.jamf.iMovie</string>
	<key>Input</key>
	<dict>
		<key>APPLICATION_NAME</key>
		<string>iMovie.app</string>
		<key>CATEGORY</key>
		<string>Media</string>
		<key>GROUP_NAME</key>
		<string>%NAME%-update-smart</string>
		<key>GROUP_TEMPLATE</key>
		<string>JamfSmartGroupTemplate.xml</string>
		<key>NAME</key>
		<string>iMovie</string>
		<key>POLICY_CATEGORY</key>
		<string>Testing</string>
		<key>POLICY_NAME</key>
		<string>Install Latest %NAME%</string>
		<key>POLICY_TEMPLATE</key>
		<string>JamfPolicyTemplate.xml</string>
		<key>POLICY_TRIGGER</key>
		<string>Install_iMovie</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>With iMovie, it's never been easier to create memorable, cinema-quality videos and let your imagination run wild. Edit videos on the fly or explore iMovie on your Mac. Design your masterpiece from scratch or get help shaping your story with the new Magic Movie and Storyboards on iPhone or iPad.</string>
		<key>SELF_SERVICE_DISPLAY_NAME</key>
		<string>Install Latest %NAME%</string>
		<key>SELF_SERVICE_ICON</key>
		<string>%NAME%.png</string>
		<key>TESTING_GROUP_NAME</key>
		<string>Testing</string>
		<key>UPDATE_PREDICATE</key>
		<string>pkg_uploaded == False</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>ParentRecipe</key>
	<string>com.github.nmcspadden.pkg.appstore</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category_name</key>
				<string>%CATEGORY%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_category</key>
				<string>%CATEGORY%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPackageUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>predicate</key>
				<string>%UPDATE_PREDICATE%</string>
			</dict>
			<key>Processor</key>
			<string>StopProcessingIf</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>computergroup_name</key>
				<string>%GROUP_NAME%</string>
				<key>computergroup_template</key>
				<string>%GROUP_TEMPLATE%</string>
				<key>replace_group</key>
				<string>True</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category_name</key>
				<string>%POLICY_CATEGORY%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>icon</key>
				<string>%SELF_SERVICE_ICON%</string>
				<key>policy_name</key>
				<string>%POLICY_NAME%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>replace_policy</key>
				<string>True</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader</string>
		</dict>
	</array>
</dict>
</plist>
