<?xml version="1.0" encoding="UTF-8"?>
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest version of Amazon Corretto Java JDK 8, builds an installer package, then uploads to the JSS.</string>
        <key>Identifier</key>
        <string>com.github.novaksam.jss.amazoncorrettojdk8</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Amazon Corretto Java JDK 8</string>
            <key>CATEGORY</key>
            <string>Apps</string>
            <key>GROUP_NAME</key>
		    <string>%NAME%-update-smart</string>
            <key>GROUP_TEMPLATE</key>
		    <string>%RECIPE_DIR%/AmazonCorrettoJDK8SmartGroupTemplate.xml</string>
            <key>EXTENSION_ATTRIBUTE_TEMPLATE</key>
		    <string>%RECIPE_DIR%/AmazonCorrettoJDK8ExtensionAttribute.xml</string>
            <key>POLICY_CATEGORY</key>
            <string>Testing</string>
            <key>POLICY_TEMPLATE</key>
            <string>%RECIPE_DIR%/PolicyTemplate.xml</string>
            <key>DESCRIPTION</key>
            <string>Install the latest version of %NAME%.</string>
            <key>ICON</key>
            <string>%RECIPE_DIR%/AmazonCorrettoJDK8.png</string>
        </dict>
        <key>MinimumVersion</key>
        <string>1.0.0</string>
        <key>ParentRecipe</key>
        <string>com.github.rtrouton.pkg.amazoncorettojdk8</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>DeprecationWarning</string>
                <key>Arguments</key>
                <dict>
                    <key>warning_message</key>
                    <string>JSSImporter, which this recipe requires, is no longer maintained. Consider switching to an equivalent JamfUploader recipe (https://github.com/grahampugh/jamf-upload/wiki/JamfUploader-AutoPkg-Processors). This JSS recipe will be removed in the future.</string>
                </dict>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
				    <key>extension_attributes</key>
				    <array>
					    <dict>
						    <key>ext_attribute_path</key>
						    <string>%EXTENSION_ATTRIBUTE_TEMPLATE%</string>
					    </dict>
				    </array>
				    <key>groups</key>
				    <array>
					    <dict>
						    <key>name</key>
						    <string>%GROUP_NAME%</string>
						    <key>smart</key>
						    <true/>
						    <key>template_path</key>
						    <string>%GROUP_TEMPLATE%</string>
					    </dict>
				    </array>
                    <key>prod_name</key>
                    <string>%NAME%</string>
                    <key>jss_inventory_name</key>
                    <string>%NAME%</string>
                    <key>category</key>
                    <string>%CATEGORY%</string>
                    <key>policy_category</key>
                    <string>%POLICY_CATEGORY%</string>
                    <key>policy_template</key>
                    <string>%POLICY_TEMPLATE%</string>
                    <key>self_service_icon</key>
                    <string>%ICON%</string>
                    <key>self_service_description</key>
                    <string>%DESCRIPTION%</string>
                </dict>
                <key>Processor</key>
                <string>JSSImporter</string>
            </dict>
        </array>
    </dict>
</plist>