<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Adoptium JDK version 8.</string>
	<key>Identifier</key>
	<string>com.github.novaksam.download.AdoptiumJDK8Intel</string>
	<key>Input</key>
	    <dict>
        	<key>NAME</key>
        	<string>Adoptium JDK 8</string>
        	<key>VENDOR</key>
        	<string>Adoptium</string>
        	<key>DISTRIBUTION</key>
        	<string>OpenJDK</string>
        	<key>SOFTWARETITLE</key>
        	<string>Java</string>
        	<key>SOFTWARETYPE</key>
        	<string>JDK</string>
        	<key>SEARCH_URL</key>
        	<string>https://github.com/adoptium/temurin8-binaries/releases/latest</string>
        	<key>SEARCH_PATTERN</key>
        	<string>(https.*?OpenJDK8U-jdk.*?\.pkg)</string>
    	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>%SEARCH_PATTERN%</string>
				<key>url</key>
				<string>%SEARCH_URL%</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
				<key>url</key>
				<string>%match%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/*.app</string>
				<key>requirement</key>
				<string>identifier "com.google.android.studio" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = EQHXZ8M8AV</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
