<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Android Studio IDE from Google.

	For Intel set DOWNLOAD_ARCH to "mac" and SUPPORTED_ARCH to "x86_64"

	For Apple Silicon set DOWNLOAD_ARCH to "mac_arm" and SUPPORTED_ARCH to "arm64"
	</string>
	<key>Identifier</key>
	<string>com.github.novaksam.download.AndroidStudio</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>AndroidStudio</string>
		<key>DOWNLOAD_ARCH</key>
		<string>mac</string>
		<key>SUPPORTED_ARCH</key>
		<string>x86_64</string>
		<key>SEARCH_PATTERN</key>
		<string>(https\://edgedl\.me\.gvt1\.com/android/studio/install/.+/android-studio.+%DOWNLOAD_ARCH%\.dmg)</string>
		<key>SEARCH_URL</key>
		<string>https://developer.android.com/studio</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>%SEARCH_PATTERN%</string>
				<key>url</key>
				<string>%SEARCH_URL%</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-%SUPPORTED_ARCH%.dmg</string>
				<key>url</key>
				<string>%match%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/*.app</string>
				<key>requirement</key>
				<string>identifier "com.google.android.studio" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = EQHXZ8M8AV</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
