<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest Android Studio IDE from Google.

Downloads both the ARM and Intel builds.
		</string>
		<key>Identifier</key>
		<string>com.github.novaksam.download.AndroidStudio-Universal</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>AndroidStudio</string>
			<key>ARM_ARCHITECTURE</key>
			<string>mac_arm</string>
			<key>INTEL_ARCHITECTURE</key>
			<string>mac</string>
			<key>SEARCH_PATTERN_ARM</key>
			<string>(https\://redirector\.gvt1\.com/edgedl/android/studio/install/.+/android-studio.+%ARM_ARCHITECTURE%\.dmg)</string>
			<key>SEARCH_PATTERN_INTEL</key>
			<string>(https\://redirector\.gvt1\.com/edgedl/android/studio/install/.+/android-studio.+%INTEL_ARCHITECTURE%\.dmg)</string>
			<key>SEARCH_URL</key>
			<string>https://developer.android.com/studio</string>
		</dict>
		<key>MinimumVersion</key>
		<string>0.4.0</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>re_pattern</key>
					<string>%SEARCH_PATTERN_ARM%</string>
					<key>url</key>
					<string>%SEARCH_URL%</string>
				</dict>
				<key>Processor</key>
				<string>URLTextSearcher</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>filename</key>
					<string>%NAME%-%ARM_ARCHITECTURE%.dmg</string>
					<key>url</key>
					<string>%match%</string>
				</dict>
				<key>Processor</key>
				<string>URLDownloader</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
				<key>Arguments</key>
				<dict>
					<key>arm_path</key>
					<string>%pathname%</string>
				</dict>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>re_pattern</key>
					<string>%SEARCH_PATTERN_INTEL%</string>
					<key>url</key>
					<string>%SEARCH_URL%</string>
				</dict>
				<key>Processor</key>
				<string>URLTextSearcher</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>filename</key>
					<string>%NAME%-%INTEL_ARCHITECTURE%.dmg</string>
					<key>url</key>
					<string>%match%</string>
				</dict>
				<key>Processor</key>
				<string>URLDownloader</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
				<key>Arguments</key>
				<dict>
					<key>intel_path</key>
					<string>%pathname%</string>
				</dict>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>input_path</key>
					<string>%arm_path%/*.app</string>
					<key>requirement</key>
					<string>identifier "com.google.android.studio" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = EQHXZ8M8AV</string>
				</dict>
				<key>Processor</key>
				<string>CodeSignatureVerifier</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>input_path</key>
					<string>%intel_path%/*.app</string>
					<key>requirement</key>
					<string>identifier "com.google.android.studio" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = EQHXZ8M8AV</string>
				</dict>
				<key>Processor</key>
				<string>CodeSignatureVerifier</string>
			</dict>
		</array>
	</dict>
</plist>
