<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Brackets.</string>
    <key>Identifier</key>
    <string>com.github.novaksam.download.Brackets</string>
	<key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Brackets</string>
        <key>VERSION_URL</key>
        <string>https://github.com/adobe/brackets/releases.atom</string>
        <key>VERSION_PATTERN</key>
        <string>(/adobe/brackets/releases/tag/release-.+eb\d+)</string>
        <key>DOWNLOAD_PATTERN</key>
        <string>(/adobe/brackets/releases/download/release-.+eb\d+.+\.dmg)</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>Process</key>
    <array>
    	<dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%VERSION_URL%</string>
                <key>re_pattern</key>
                <string>%VERSION_PATTERN%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://github.com%match%</string>
                <key>re_pattern</key>
                <string>%DOWNLOAD_PATTERN%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://github.com%match%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>