<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest crystalexplorer</string>
	<key>Identifier</key>
	<string>com.github.novaksam.download.CrystalExplorer</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>CrystalExplorer</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>CrystalExplorer-([0-9\.]+)-Darwin.dmg</string>
				<key>url</key>
				<string>https://crystalexplorer.net/download.html</string>
				<key>result_output_var_name</key>
                <string>version</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>(https://.*CrystalExplorer-[0-9\.]+-Darwin.dmg)</string>
				<key>url</key>
				<string>https://crystalexplorer.net/download.html</string>
				<key>result_output_var_name</key>
                <string>url</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
