<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of FontForge.</string>
	<key>Identifier</key>
	<string>com.github.novaksam.download.FontForge</string>
	<key>Input</key>
	<dict>
		<key>DOWNLOAD_PATTERN</key>
		<string>(/fontforge/fontforge/releases/download/\d+\/.+\.dmg)</string>
		<key>NAME</key>
		<string>FontForge</string>
		<key>VERSION_PATTERN</key>
		<string>(/fontforge/fontforge/releases/tag/\d+(?="))</string>
		<key>VERSION_URL</key>
		<string>https://github.com/fontforge/fontforge/releases.atom</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>%VERSION_PATTERN%</string>
				<key>url</key>
				<string>%VERSION_URL%</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>%DOWNLOAD_PATTERN%</string>
				<key>url</key>
				<string>https://github.com%match%</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
				<key>url</key>
				<string>https://github.com%match%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
