<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of jamovi.</string>
	<key>Identifier</key>
	<string>com.github.novaksam.download.jamovi</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>jamovi</string>
		<key>RELEASE</key>
		<string>solid</string>
		<key>Sig_OU_Note</key>
		<string>Depending on if you choose solid (W84U6Y3S2L) or current ("9NCBP559AB") the Team ID has changed. Obviously this is inconvenient, and less secure, but we play the hands we're dealt</string>
		<key>Sig_OU</key>
		<string>"9NCBP559AB"</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>([0-9\.]+).*[\r\n|\n|\r]+.*%RELEASE%</string>
				<key>url</key>
				<string>https://www.jamovi.org/download.html</string>
				<key>result_output_var_name</key>
                <string>version</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>(/downloads/.*%version%.*.dmg)</string>
				<key>url</key>
				<string>https://www.jamovi.org/download.html</string>
				<key>result_output_var_name</key>
                <string>url</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
				<key>url</key>
				<string>https://www.jamovi.org%url%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/jamovi.app</string>
				<key>requirement</key>
				<string>identifier "org.jamovi.jamovi" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = %Sig_OU%</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
