<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest NoMachine.</string>
	<key>Identifier</key>
	<string>com.github.novaksam.download.NoMachine</string>
	<key>Input</key>
	<dict>
		<key>DOWNLOAD_PATTERN</key>
		<string>(https://.*nomachine_[0-9\.\_]+.dmg)</string>
		<key>DOWNLOAD_URL</key>
		<string>https://downloads.nomachine.com/download/?id=7</string>
		<key>NAME</key>
		<string>NoMachine</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>%DOWNLOAD_PATTERN%</string>
				<key>url</key>
				<string>%DOWNLOAD_URL%</string>
				<key>curl_opts</key>
				<array>
					<string>-b nomachine_cookies.txt -L</string>
				</array>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
				<key>url</key>
				<string>%match%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: NoMachine S.a.r.l. (493C5JZAGR)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
				<key>input_path</key>
				<string>%pathname%/*.pkg</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
