<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest CUDA toolkit from Nvidia.</string>
	<key>Identifier</key>
	<string>com.github.novaksam.download.NvidiaCUDAToolkit</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>NvidiaCudaToolkit</string>
		<key>SEARCH_PATTERN</key>
		<string>(/compute/cuda/[0-9]+.[0-9]+/Prod/local_installers/cuda_[0-9]+.[0-9]+.[0-9]+_mac)</string>
		<key>SEARCH_URL</key>
		<string>https://developer.nvidia.com/cuda-downloads?target_os=MacOSX&amp;target_arch=x86_64&amp;target_type=dmglocal</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>warning_message</key>
				<string>Nvidia CUDA 10.2 (toolkit and driver) was the last release to support macOS. Details:
	- https://docs.nvidia.com/cuda/archive/10.2/cuda-toolkit-release-notes/index.html#title-new-features
	- https://mjtsai.com/blog/2019/11/25/nvidia-drops-cuda-support-for-macos/
	- https://gizmodo.com/apple-and-nvidia-are-over-1840015246
				</string>
			</dict>
			<key>Processor</key>
			<string>DeprecationWarning</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>%SEARCH_PATTERN%</string>
				<key>url</key>
				<string>%SEARCH_URL%</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
				<key>url</key>
				<string>http://developer.download.nvidia.com/%match%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Application: NVIDIA Corporation</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
				<key>input_path</key>
				<string>%pathname%/*.app</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
