<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest CUDA Driver from Nvidia.</string>
	<key>Identifier</key>
	<string>com.github.novaksam.download.NvidiaCUDADriver</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Nvidia CUDA driver</string>
		<key>SEARCH_PATTERN</key>
		<string>(//us.download.nvidia.com/Mac/cuda_[0-9]+/cudadriver_[0-9]+.[0-9]+_macos.dmg)</string>
		<key>SEARCH_URL</key>
		<string>https://www.nvidia.com/object/cuda-mac-driver.html</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>warning_message</key>
				<string>Nvidia CUDA 10.2 (toolkit and driver) was the last release to support macOS. Details:
	- https://docs.nvidia.com/cuda/archive/10.2/cuda-toolkit-release-notes/index.html#title-new-features
	- https://mjtsai.com/blog/2019/11/25/nvidia-drops-cuda-support-for-macos/
	- https://gizmodo.com/apple-and-nvidia-are-over-1840015246
				</string>
			</dict>
			<key>Processor</key>
			<string>DeprecationWarning</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>%SEARCH_PATTERN%</string>
				<key>url</key>
				<string>%SEARCH_URL%</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https:%match%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: NVIDIA Corporation (6KR3T733EC)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
				<key>input_path</key>
				<string>%pathname%/*.pkg</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
