<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest installer for suspicious package. 
	Verification bit borrowed from com.github.jps3.download.SuspiciousPackageQLP</string>
	<key>Identifier</key>
	<string>com.github.novaksam.download.SuspiciousPackage</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Suspicious Package</string>
		<key>pkg_url</key>
		<string>http://www.mothersruin.com/software/downloads/SuspiciousPackage.xip</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%pkg_url%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
